test/assets/vcr_cassettes/stripe_recurring_booking.yml

---
http_interactions:
- request:
    method: post
    uri: https://sk_test_DoIom7ZOL848ziY39cC75lI0:@api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=cc_user%40near-me.com&card[number]=4111111111111111&card[exp_month]=1&card[exp_year]=2019&card[cvc]=111&card[name]=Rowan+Atkinson
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.47.0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.47.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Stripe-Version:
      - '2016-07-06'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 26 Jun 2017 21:33:27 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1409'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_Auufh4vbCVWeMB
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_AuufmyIroLngZC",
          "object": "customer",
          "account_balance": 0,
          "created": 1498512806,
          "currency": null,
          "default_source": "card_1AZ4pmK2MWM5GsITXqXSbRZc",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "cc_user@near-me.com",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1AZ4pmK2MWM5GsITXqXSbRZc",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_AuufmyIroLngZC",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 1,
                "exp_year": 2019,
                "fingerprint": "CtVQWwJF8UOWYf83",
                "funding": "unknown",
                "last4": "1111",
                "metadata": {},
                "name": "Rowan Atkinson",
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AuufmyIroLngZC/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_AuufmyIroLngZC/subscriptions"
          }
        }
    http_version: 
  recorded_at: Mon, 26 Jun 2017 21:33:27 GMT
- request:
    method: post
    uri: https://sk_test_DoIom7ZOL848ziY39cC75lI0:@api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=1670&currency=usd&card=card_1AZ4pmK2MWM5GsITXqXSbRZc&customer=cus_AuufmyIroLngZC&payment_user_agent=Stripe%2Fv1+ActiveMerchantBindings%2F1.47.0
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.47.0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.47.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Stripe-Version:
      - '2016-07-06'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 26 Jun 2017 21:33:28 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1785'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_Auufmo3SgtnjBn
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_1AZ4poK2MWM5GsIT1f58EFEw",
          "object": "charge",
          "amount": 1670,
          "amount_refunded": 0,
          "application": null,
          "application_fee": null,
          "balance_transaction": "txn_1AZ4poK2MWM5GsITaysY01Vy",
          "captured": true,
          "created": 1498512808,
          "currency": "usd",
          "customer": "cus_AuufmyIroLngZC",
          "description": null,
          "destination": null,
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {},
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "on_behalf_of": null,
          "order": null,
          "outcome": {
            "network_status": "approved_by_network",
            "reason": null,
            "risk_level": "normal",
            "seller_message": "Payment complete.",
            "type": "authorized"
          },
          "paid": true,
          "receipt_email": null,
          "receipt_number": null,
          "refunded": false,
          "refunds": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges/ch_1AZ4poK2MWM5GsIT1f58EFEw/refunds"
          },
          "review": null,
          "shipping": null,
          "source": {
            "id": "card_1AZ4pmK2MWM5GsITXqXSbRZc",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "customer": "cus_AuufmyIroLngZC",
            "cvc_check": "pass",
            "dynamic_last4": null,
            "exp_month": 1,
            "exp_year": 2019,
            "fingerprint": "CtVQWwJF8UOWYf83",
            "funding": "unknown",
            "last4": "1111",
            "metadata": {},
            "name": "Rowan Atkinson",
            "tokenization_method": null
          },
          "source_transfer": null,
          "statement_descriptor": null,
          "status": "succeeded",
          "transfer_group": null
        }
    http_version: 
  recorded_at: Mon, 26 Jun 2017 21:33:28 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/balance/history/txn_1AZ4poK2MWM5GsITaysY01Vy
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.57.0
      Authorization:
      - Bearer sk_test_DoIom7ZOL848ziY39cC75lI0
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-07-06'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.57.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        MacBook-Pro 15.6.0 Darwin Kernel Version 15.6.0: Fri Feb 17 10:21:18 PST 2017;
        root:xnu-3248.60.11.4.1~1/RELEASE_X86_64 x86_64","hostname":"MacBook-Pro"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 26 Jun 2017 21:33:29 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '678'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AuufLkcf3hBrKY
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "txn_1AZ4poK2MWM5GsITaysY01Vy",
          "object": "balance_transaction",
          "amount": 1670,
          "available_on": 1499040000,
          "created": 1498512808,
          "currency": "usd",
          "description": null,
          "fee": 78,
          "fee_details": [
            {
              "amount": 78,
              "application": null,
              "currency": "usd",
              "description": "Stripe processing fees",
              "type": "stripe_fee"
            }
          ],
          "net": 1592,
          "source": "ch_1AZ4poK2MWM5GsIT1f58EFEw",
          "sourced_transfers": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/transfers?source_transaction=ch_1AZ4poK2MWM5GsIT1f58EFEw"
          },
          "status": "pending",
          "type": "charge"
        }
    http_version: 
  recorded_at: Mon, 26 Jun 2017 21:33:29 GMT
- request:
    method: post
    uri: https://sk_test_DoIom7ZOL848ziY39cC75lI0:@api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=1670&currency=usd&&payment_user_agent=Stripe%2Fv1+ActiveMerchantBindings%2F1.47.0
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Stripe/v1 ActiveMerchantBindings/1.47.0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.47.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","publisher":"active_merchant"}'
      X-Stripe-Client-User-Metadata:
      - '{"ip":null}'
      Stripe-Version:
      - '2016-07-06'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - nginx
      Date:
      - Mon, 26 Jun 2017 21:33:30 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '108'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AuufNDPeVGcGpA
      Stripe-Version:
      - '2016-07-06'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "type": "invalid_request_error",
            "message": "Must provide source or customer."
          }
        }
    http_version: 
  recorded_at: Mon, 26 Jun 2017 21:33:30 GMT
recorded_with: VCR 3.0.3
